test/artillery/GET-requests.yml
config:
  target: "http://localhost:1337/qa/questions"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 25
      name: Ramp up load
    - duration: 60
      arrivalRate: 25
      name: Sustained load
  payload:
    path: "GET-queries.csv"
    fields:
      - "question_id"
      - "product_id"
    order: sequence
    skipHeader: true

scenarios:
  - flow:
      - log: "Querying answers\n-question_id: {{ question_id }}"
      - get:
          url: "/{{ question_id }}/answers"
      - log: "Querying questions\n-product_id: {{ product_id }}"
      - get:
          url: "/"
          qs:
            product_id: "{{ product_id }}"